final_signed_message.xml

<?xml version='1.0' encoding='utf-8'?>
<soap11:Envelope xmlns:header="http://sys.svc.tennet.nl/MMCHub/Header/v1" xmlns:soap11="http://schemas.xmlsoap.org/soap/envelope/">
  <soap11:Header>
    <wsse:Security xmlns:wsu="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-utility-1.0.xsd" xmlns:wsse="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-secext-1.0.xsd" soap11:mustUnderstand="1">
      <wsse:BinarySecurityToken EncodingType="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-soap-message-security-1.0#Base64Binary" ValueType="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-x509-token-profile-1.0#X509v3" wsu:Id="X509Token">
MIIGNjCCBB6gAwIBAgIQAjudA9L/gOg5IBSTwOERjjANBgkqhkiG9w0BAQsFADBi
MQswCQYDVQQGEwJVUzEXMBUGA1UEChMORGlnaUNlcnQsIEluYy4xOjA4BgNVBAMT
MURpZ2lDZXJ0IEFzc3VyZWQgRzIgU01JTUUgUlNBNDA5NiBTSEEzODQgMjAyNCBD
QTEwHhcNMjUwMTMwMDAwMDAwWhcNMjgwMTI5MjM1OTU5WjBsMRcwFQYDVQRhEw5O
VFJOTC03MzEwMjQzMTELMAkGA1UEBhMCTkwxDzANBgNVBAcTBlZlZ2hlbDEUMBIG
A1UEChMLQ292b2x0IEIuVi4xHTAbBgNVBAMMFHNlcnZpY2UtbmxAY292b2x0LmV1
MIIBIjANBgkqhkiG9w0BAQEFAAOCAQ8AMIIBCgKCAQEA3668ejzvq08G4a4Qv1b0
RqkGeKYa44ZAby9hr4n4xUkDo2THUjFku68YBLpqnl3FgA8utdQWX+YAYArsJzZ2
cMolIDWw1A9ykItXwE+rNt1npVVlPonFSd7WPm0+20m9xwd3P16gSVHbjiUq/8J1
en5zCGkTCgK6x7tyEbceMEwnRWHgxlqaRT2zYcDb3YkeC2pNyPKWXQvhV82br7+Z
T2tVZ0Jz7PDPysR8ndIg5yjhNkaG+SHC4nzd/uLvkWGxkRafeqBWMS5NLPhxE4DQ
QUFWMOxTnwWy3KEr+qkOFhgMZEBmV1K06aZR1Au1Ih8ymW31r4RfcMi2ZxMvYFPT
dwIDAQABo4IB3DCCAdgwHwYDVR0jBBgwFoAU95uiTtOXxfQ0D0MOgYXOkZMyr/kw
HQYDVR0OBBYEFLgTYirHqTnZxKHMXW3GD6Hz8IvEMB8GA1UdEQQYMBaBFHNlcnZp
Y2UtbmxAY292b2x0LmV1MBQGA1UdIAQNMAswCQYHZ4EMAQUDATAOBgNVHQ8BAf8E
BAMCB4AwEwYDVR0lBAwwCgYIKwYBBQUHAwQwgakGA1UdHwSBoTCBnjBNoEugSYZH
aHR0cDovL2NybDMuZGlnaWNlcnQuY29tL0RpZ2lDZXJ0QXNzdXJlZEcyU01JTUVS
U0E0MDk2U0hBMzg0MjAyNENBMS5jcmwwTaBLoEmGR2h0dHA6Ly9jcmw0LmRpZ2lj
ZXJ0LmNvbS9EaWdpQ2VydEFzc3VyZWRHMlNNSU1FUlNBNDA5NlNIQTM4NDIwMjRD
QTEuY3JsMIGNBggrBgEFBQcBAQSBgDB+MCQGCCsGAQUFBzABhhhodHRwOi8vb2Nz
cC5kaWdpY2VydC5jb20wVgYIKwYBBQUHMAKGSmh0dHA6Ly9jYWNlcnRzLmRpZ2lj
ZXJ0LmNvbS9EaWdpQ2VydEFzc3VyZWRHMlNNSU1FUlNBNDA5NlNIQTM4NDIwMjRD
QTEuY3J0MA0GCSqGSIb3DQEBCwUAA4ICAQAU0bQs5wwskLLuJwD5f0Cgn2Rgolk1
p6ZqeGpZNpUcgDvR7ZRdtOc+jGPVqHTX+mpxw0HTUMVw29xTTd76kQkvFnZB4V9o
GuyB8sRhMMYKC4fcucD7dZT4KuPaiK3amomF7Em92SMIE0qQxGish2NaEyctNqpC
oPj22nJDvGTz6jyjNb8z7tn+FXTuIScIUnQyoKrWyvsknK6FV8ApaHpcDAWRrTAq
TVjik9JOKkb6uzPAt+V60I+DTBjMqhimpEpwbGV6ksW3BJV58gBkICRxMT2AJM8w
B8ZWRogG/AYV+csPeLNhi6CTbfe6rWaNw4sYYaDQnF2IgdCtZB4S8ktDXMWs3W4n
Y6wJM3fcWOTag3WiG/WetPobSSK2Vl4RPp57Po+eMW7QaiB83W2FVaVDUstS8DfB
ym7AgIxThT/v/B+W9T1nOfwSd9HTMcprYghMHxsBe50nTOUimSeOQxbWfH9u8O7T
VMkVlu3nj49Xrc1Bw74FJ+pYSeuSUwiJkDqjay44za3m4zfncgwfN7cWbI2WCOqS
H2wggy8LNmXg65m1r1axVjzTU0iwDQ6UO4smO6bv9VuLic9wP/dPmG3qERvE+kIY
cT4UjpyRyMX+MYcw+xbcm/+q4QSNIVvWR8j+L1rkT63sm9j7XgfC/N7ZIuY+Slpt
f8QMqc8zt5l1Yg==

</wsse:BinarySecurityToken>
    <ds:Signature xmlns:ds="http://www.w3.org/2000/09/xmldsig#" Id="8c44d7e9-81f0-45b7-aa81-da6b8d68af97"><ds:SignedInfo><ds:CanonicalizationMethod Algorithm="http://www.w3.org/2001/10/xml-exc-c14n#"><ec:InclusiveNamespaces xmlns:ec="http://www.w3.org/2001/10/xml-exc-c14n#" PrefixList="header soap11"/><ec:InclusiveNamespaces xmlns:ec="http://www.w3.org/2001/10/xml-exc-c14n#" PrefixList="header soap11"/></ds:CanonicalizationMethod><ds:SignatureMethod Algorithm="http://www.w3.org/2001/04/xmldsig-more#rsa-sha256"/><ds:Reference URI="#id-67dbbff3-a79f-48f7-9275-f622ccbdea7d"><ds:Transforms><ds:Transform Algorithm="http://www.w3.org/2001/10/xml-exc-c14n#"> <ec:InclusiveNamespaces xmlns:ec="http://www.w3.org/2001/10/xml-exc-c14n#" PrefixList="header"/> <ec:InclusiveNamespaces xmlns:ec="http://www.w3.org/2001/10/xml-exc-c14n#" PrefixList="header"/></ds:Transform></ds:Transforms><ds:DigestMethod Algorithm="http://www.w3.org/2001/04/xmlenc#sha256"/><ds:DigestValue>w35gFl85eumJBCJSBvBCYZX4ZbfHdONwP1blVIcHdic=</ds:DigestValue></ds:Reference></ds:SignedInfo><ds:SignatureValue>HfMh0HTuVHzCMmNsoBrirg/VfHAwdZbrIDpbVf9hBtUoZ2rCa5GXZ30cvpo5uIW6UNJ8utVqWiFCXzhVSy4/opITOJF62U4XJIoCjnJXEeFYRTCofh3P6vod56o7HSESaxmUCCU1PKS3NsCkbiDXie1vs6QbwdormjLdVZ7GAEz7tpM66gh+QYu8SbW/bbEJrHGXEn2B9ooVHh71X82Wd7g5YdDw2+Z2fW/0aDiV1mKQuuTpE++S5d5lyxbWV6rN1Ab8gHhgiC5ZsJznwDQgASAl6QM3ox5rwlVileHKY8hGPYukeVJraT4iyc4arteqn4/jK1/CN1myXB/HrFypVg==</ds:SignatureValue>
<ds:KeyInfo Id="361aed54edtr4d3346a">
  <wsse:SecurityTokenReference wsu:Id="ahsh47dtwgs78w2w9sjdjee238">
    <wsse:KeyIdentifier ValueType="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-x509-token-profile-1.0#X509SubjectKeyIdentifier" EncodingType="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-soap-message-security-1.0#Base64Binary">
      mhnbrPErh6twY/YX2Bl4pCgG9Kc=
    </wsse:KeyIdentifier>
  </wsse:SecurityTokenReference>
</ds:KeyInfo>
</ds:Signature></wsse:Security>
    <header:MessageAddressing xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:xs="http://www.w3.org/2001/XMLSchema" xmlns:wsu="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-utility-1.0.xsd" xmlns:wsse="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-secext-1.0.xsd" xmlns:tsm="http://tennet.eu/cdm/tennet/TennetService/Message/v2.0" xmlns:tns0="http://tennet.eu/cdm/tennet/v1.0" xmlns:tns="http://sys.svc.tennet.nl/AncillaryServices" xmlns:tas="http://sys.svc.tennet.nl/AncillaryServices/v1" xmlns:ead="urn:iec62325.351:tc57wg16:451-4:energyaccountdocument:4:0" xmlns:common="http://sys.svc.tennet.nl/MMCHub/common/v1" xmlns:cl="urn:entsoe.eu:wgedi:codelists">
      <header:technicalMessageId>839e6e9b-f73e-4846-bb02-feee56b6d5d2</header:technicalMessageId>
      <header:correlationId>839e6e9b-f73e-4846-bb02-feee56b6d5d2</header:correlationId>
      <header:senderId>8719333027500</header:senderId>
      <header:receiverId>8716867999983</header:receiverId>
      <header:carrierId>8719333027500</header:carrierId>
      <header:contentType>ACTIVATED_FCR</header:contentType>
    </header:MessageAddressing>
  </soap11:Header>
  <soap11:Body xmlns:wsu="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-utility-1.0.xsd" wsu:Id="id-67dbbff3-a79f-48f7-9275-f622ccbdea7d">
    <EnergyAccount_MarketDocument xmlns="urn:iec62325.351:tc57wg16:451-4:energyaccountdocument:4:0">
      <mRID>DOC-FCR-20250340-0001</mRID>
      <revisionNumber>1</revisionNumber>
      <type>A45</type>
      <docStatus>
        <value>A07</value>
      </docStatus>
      <process.processType>A28</process.processType>
      <process.classificationType>A02</process.classificationType>
      <sender_MarketParticipant.mRID codingScheme="A01">8719333027500</sender_MarketParticipant.mRID>
      <sender_MarketParticipant.marketRole.type>A12</sender_MarketParticipant.marketRole.type>
      <receiver_MarketParticipant.mRID codingScheme="A01">8716867999983</receiver_MarketParticipant.mRID>
      <receiver_MarketParticipant.marketRole.type>A04</receiver_MarketParticipant.marketRole.type>
      <createdDateTime>2025-04-25T07:40:00Z</createdDateTime>
      <period.timeInterval>
        <start>2025-04-23T22:00Z</start>
        <end>2025-04-24T02:00Z</end>
      </period.timeInterval>
      <TimeSeries>
        <mRID>TS-20250340-01</mRID>
        <businessType>A11</businessType>
        <product>8716867000016</product>
        <objectAggregation>A02</objectAggregation>
        <area_Domain.mRID codingScheme="A01">10YNL----------L</area_Domain.mRID>
        <measure_Unit.name>MAW</measure_Unit.name>
        <currency_Unit.name>EUR</currency_Unit.name>
        <marketEvaluationPoint.mRID codingScheme="A01">871687910000500037</marketEvaluationPoint.mRID>
        <Period>
          <timeInterval>
            <start>2025-04-23T22:00Z</start>
            <end>2025-04-24T02:00Z</end>
          </timeInterval>
          <resolution>PT1S</resolution>
          <Point>
            <position>1</position>
            <in_Quantity.quantity>0.000000</in_Quantity.quantity>
            <out_Quantity.quantity>520.350282</out_Quantity.quantity>
          </Point>
          <Point>
            <position>2</position>
            <in_Quantity.quantity>0.000000</in_Quantity.quantity>
            <out_Quantity.quantity>678.343953</out_Quantity.quantity>
          </Point>
          <Point>
            <position>3</position>
            <in_Quantity.quantity>0.000000</in_Quantity.quantity>
            <out_Quantity.quantity>0.313897</out_Quantity.quantity>
          </Point>
          <Point>
            <position>4</position>
            <in_Quantity.quantity>0.000000</in_Quantity.quantity>
            <out_Quantity.quantity>956.974070</out_Quantity.quantity>
          </Point>
          <Point>
            <position>5</position>
            <in_Quantity.quantity>0.000000</in_Quantity.quantity>
            <out_Quantity.quantity>483.511276</out_Quantity.quantity>
          </Point>
          <Point>
            <position>6</position>
            <in_Quantity.quantity>0.000000</in_Quantity.quantity>
            <out_Quantity.quantity>476.902003</out_Quantity.quantity>
          </Point>
          <Point>
            <position>7</position>
            <in_Quantity.quantity>0.000000</in_Quantity.quantity>
            <out_Quantity.quantity>513.329328</out_Quantity.quantity>
          </Point>
          <Point>
            <position>8</position>
            <in_Quantity.quantity>0.000000</in_Quantity.quantity>
            <out_Quantity.quantity>447.901314</out_Quantity.quantity>
          </Point>
          <Point>
            <position>9</position>
            <in_Quantity.quantity>0.000000</in_Quantity.quantity>
            <out_Quantity.quantity>924.970759</out_Quantity.quantity>
          </Point>
          <Point>
            <position>10</position>
            <in_Quantity.quantity>0.000000</in_Quantity.quantity>
            <out_Quantity.quantity>588.356499</out_Quantity.quantity>
          </Point>
        </Period>
      </TimeSeries>
    </EnergyAccount_MarketDocument>
  </soap11:Body>
</soap11:Envelope>
